test/artillery-performance.yml
config:
  # target: "https://wagk3mtyg2.us-east-1.awsapprunner.com"
  target: "https://s3proxy.forkzero.com"
  plugins:
    expect: {}
  phases:
    - duration: 60
      arrivalRate: 10
      name: warm up phase
    - duration: 600 
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
scenarios:
  - flow:
      - get:
          url: "/index.html"
          expect:
            - statusCode: 200
            - contentType: text/html
            - headerEquals:
                - "content-length"
                - "338"
  - flow:
      - get:
          url: "/unauthorized.html"
          expect:
            - statusCode: 403
  - flow:
      - get:
          url: "/zerobytefile"
          expect:
            - statusCode: 200
            - contentType: binary/octet-stream
            - headerEquals:
                - "content-length"
                - "0"
  - flow:
      - get:
          url: "/filenotfound"
          expect:
            - statusCode: 404
            - contentType: application/xml